base/Documents/бит_ЗакрытиеСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ЗакрытиеСчетов</Name>
			<BasedOn>
				<xr:Item>Catalog.бит_НастройкиЗакрытия</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.бит_Дополнительный_4</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоБюджетам</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_3</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_1</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.бит_СоответствиеОборотовТрансляции</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоТипамПроводок</xr:Item>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_5</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_2</xr:Item>
				<xr:Item>InformationRegister.бит_СоответствиеЗаписейТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>Сценарий бюджетирования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗакрытия</Name>
					<Comment>Вид закрытия счетов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВидыЗакрытияСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НастройкиЗакрытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
					<Comment>Объект системы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВЗакрытомПериоде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСторно</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Закрытие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Comment>ЦФО</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_5</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Бюджетирование</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_4</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_3</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_1</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто4</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗакрытия</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_5</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Бюджетирование</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_4</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_3</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_1</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДтКт</Name>
							<Comment>Указывает куда закрывать, имеет смысл для активно-пассивных счетов</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ДтКт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоЗакрытия1</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоЗакрытия2</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоЗакрытия3</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоЗакрытия4</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеЗакрытия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютнаяСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЖурнала</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/Enums/бит_ДтКт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ДтКт</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Documents/бит_ЗакрытиеСчетов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
			
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	// ++ ЕРП
	
КонецПроцедуры

#КонецОбласти 	

#Область СлужебныйПрограммныйИнтерфейс

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;
	ПараметрыПроведения.Вставить("СторноЗакрытиеСчетов", 		Новый ТаблицаЗначений);
	ПараметрыПроведения.Вставить("СторноЗакрытиеСчетовТаблица", Новый ТаблицаЗначений);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Сторно КАК Сторно,
	|	Реквизиты.РегистрБухгалтерии КАК РегистрБухгалтерии,
	|	Реквизиты.НастройкаЗакрытия КАК НастройкаЗакрытия
	|ИЗ
	|	Документ.бит_ЗакрытиеСчетов КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Результат    	 = Запрос.Выполнить();
	ТаблицаРеквизиты = Результат.Выгрузить();
	
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаРеквизиты[0]);

	НомераТаблиц = Новый Структура;
	Запрос.Текст = ТекстЗапросаЗакрытиеСчетов(НомераТаблиц, Реквизиты)
				 + ТекстЗапросаНастройкаЗакрытия(НомераТаблиц);
	
	Запрос.УстановитьПараметр("НастройкаЗакрытия", Реквизиты.НастройкаЗакрытия);
	
	ПараметрыРегистра = бит_РегламентныеЗакрытия.ПараметрыРегистраБухгалтерии(Реквизиты.РегистрБухгалтерии);
	Для каждого КлючЗначение Из ПараметрыРегистра Цикл
		Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла; 

	Результат = Запрос.ВыполнитьПакет();
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	ЗаполнитьСодержаниеПроводки(ПараметрыПроведения.ЗакрытиеСчетовТаблица, Ложь);
	ЗаполнитьСодержаниеПроводки(ПараметрыПроведения.СторноЗакрытиеСчетовТаблица, Истина);
	
	Возврат ПараметрыПроведения;
	
КонецФункции 

Процедура СформироватьПроводки(ТаблицаЗакрытиеСчетов, ТаблицаРеквизиты, НастройкаЗакрытия, Движения, Отказ) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТаблицаЗакрытиеСчетов) ИЛИ НЕ ЗначениеЗаполнено(ТаблицаРеквизиты) Тогда
		Возврат;
	КонецЕсли;

	Реквизиты = ТаблицаРеквизиты[0];
	
	НаборЗаписей = Движения[Реквизиты.ИмяРегистра];
	НаборЗаписей.Записывать = Истина;
	
	Для каждого СтрокаТаблицы Из ТаблицаЗакрытиеСчетов Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.ДтКт) Тогда
			СторонаПроводки = ?(СтрокаТаблицы.ДтКт = Перечисления.бит_ДтКт.Дт, "Кт", "Дт");
		Иначе	
			СвойстваСчета = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СтрокаТаблицы.Счет);
			СторонаПроводки = ?(СвойстваСчета.Вид = ВидСчета.Активный 
								ИЛИ СвойстваСчета.Вид = ВидСчета.АктивноПассивный, "Кт", "Дт");
		КонецЕсли; 
							
		Проводка = НаборЗаписей.Добавить();
		ДобавитьПроводку(Проводка, Реквизиты, СтрокаТаблицы, СторонаПроводки, НастройкаЗакрытия);
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьКоличествоСубконтоДокумента() Экспорт

	КоличествоСубконто = 4;
	Возврат КоличествоСубконто;
	
КонецФункции

Функция ИменаРесурсов() Экспорт
	
	СписокИмен = Новый СписокЗначений;
	СписокИмен.Добавить("Сумма1");
	СписокИмен.Добавить("Сумма2");
	СписокИмен.Добавить("Сумма3");
	СписокИмен.Добавить("Сумма4");

	Возврат СписокИмен;
	
КонецФункции

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЗакрытиеСчетов(НомераТаблиц, Реквизиты)

	НомераТаблиц.Вставить("ВременнаяТаблицаДокумента", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВременнаяТаблицаРеквизиты", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ЗакрытиеСчетов", 		   НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ЗакрытиеСчетовТаблица", 	   НомераТаблиц.Количество());

	ТекстЗапроса =  
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.ЦФО КАК ЦФО,
	|	ТаблицаДокумента.Счет КАК Счет,
	|	ТаблицаДокумента.Субконто1 КАК Субконто1,
	|	ТаблицаДокумента.Субконто2 КАК Субконто2,
	|	ТаблицаДокумента.Субконто3 КАК Субконто3,
	|	ТаблицаДокумента.Субконто4 КАК Субконто4,
	|	ТаблицаДокумента.Подразделение КАК Подразделение,
	|	ТаблицаДокумента.СчетЗакрытия КАК СчетЗакрытия,
	|	ТаблицаДокумента.ВидУчета КАК ВидУчета,
	|	ТаблицаДокумента.ДтКт КАК ДтКт,
	|	ТаблицаДокумента.СубконтоЗакрытия1 КАК СубконтоЗакрытия1,
	|	ТаблицаДокумента.СубконтоЗакрытия2 КАК СубконтоЗакрытия2,
	|	ТаблицаДокумента.СубконтоЗакрытия3 КАК СубконтоЗакрытия3,
	|	ТаблицаДокумента.СубконтоЗакрытия4 КАК СубконтоЗакрытия4,
	|	ТаблицаДокумента.ПодразделениеЗакрытия КАК ПодразделениеЗакрытия,
	|	ТаблицаДокумента.Количество КАК Количество,
	|	ТаблицаДокумента.Валюта КАК Валюта,
	|	ТаблицаДокумента.ВалютнаяСумма КАК ВалютнаяСумма,
	|	ТаблицаДокумента.Сумма1 КАК Сумма1,
	|	ТаблицаДокумента.Сумма2 КАК Сумма2,
	|	ТаблицаДокумента.Сумма3 КАК Сумма3,
	|	ТаблицаДокумента.Сумма4 КАК Сумма4,
	|	ТаблицаДокумента.Содержание КАК Содержание,
	|	ТаблицаДокумента.НомерЖурнала КАК НомерЖурнала,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаДокумента.Счет) КАК СчетПредставление
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.бит_ЗакрытиеСчетов.Закрытие КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Дата КАК Дата,
	|	Реквизиты.ДатаСторно КАК ДатаСторно,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.Сценарий КАК Сценарий,
	|	Реквизиты.ВидЗакрытия КАК ВидЗакрытия,
	|	Реквизиты.НастройкаЗакрытия КАК НастройкаЗакрытия,
	|	Реквизиты.РегистрБухгалтерии КАК РегистрБухгалтерии,
	|	Реквизиты.ОтразитьВЗакрытомПериоде КАК ОтразитьВЗакрытомПериоде,
	|	&ИмяРегистра КАК ИмяРегистра
	|ПОМЕСТИТЬ Реквизиты
	|ИЗ
	|	Документ.бит_ЗакрытиеСчетов КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Регистратор КАК Регистратор,
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.Сценарий КАК Сценарий,
	|	Реквизиты.ВидЗакрытия КАК ВидЗакрытия,
	|	Реквизиты.НастройкаЗакрытия КАК НастройкаЗакрытия,
	|	Реквизиты.РегистрБухгалтерии КАК РегистрБухгалтерии,
	|	Реквизиты.ОтразитьВЗакрытомПериоде КАК ОтразитьВЗакрытомПериоде,
	|	Реквизиты.ИмяРегистра КАК ИмяРегистра
	|ИЗ
	|	Реквизиты КАК Реквизиты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.ЦФО КАК ЦФО,
	|	ТаблицаДокумента.Счет КАК Счет,
	|	ТаблицаДокумента.Субконто1 КАК Субконто1,
	|	ТаблицаДокумента.Субконто2 КАК Субконто2,
	|	ТаблицаДокумента.Субконто3 КАК Субконто3,
	|	ТаблицаДокумента.Субконто4 КАК Субконто4,
	|	ТаблицаДокумента.Подразделение КАК Подразделение,
	|	ТаблицаДокумента.СчетЗакрытия КАК СчетЗакрытия,
	|	ТаблицаДокумента.ВидУчета КАК ВидУчета,
	|	ТаблицаДокумента.ДтКт КАК ДтКт,
	|	ТаблицаДокумента.СубконтоЗакрытия1 КАК СубконтоЗакрытия1,
	|	ТаблицаДокумента.СубконтоЗакрытия2 КАК СубконтоЗакрытия2,
	|	ТаблицаДокумента.СубконтоЗакрытия3 КАК СубконтоЗакрытия3,
	|	ТаблицаДокумента.СубконтоЗакрытия4 КАК СубконтоЗакрытия4,
	|	ТаблицаДокумента.ПодразделениеЗакрытия КАК ПодразделениеЗакрытия,
	|	ТаблицаДокумента.Количество КАК Количество,
	|	ТаблицаДокумента.Валюта КАК Валюта,
	|	ТаблицаДокумента.ВалютнаяСумма КАК ВалютнаяСумма,
	|	ТаблицаДокумента.Сумма1 КАК Сумма1,
	|	ТаблицаДокумента.Сумма2 КАК Сумма2,
	|	ТаблицаДокумента.Сумма3 КАК Сумма3,
	|	ТаблицаДокумента.Сумма4 КАК Сумма4,
	|	ТаблицаДокумента.Содержание КАК Содержание,
	|	ТаблицаДокумента.НомерЖурнала КАК НомерЖурнала,
	|	ТаблицаДокумента.СчетПредставление КАК СчетПредставление
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";	
	
	Если Реквизиты.Сторно Тогда
		
		НомераТаблиц.Вставить("СторноЗакрытиеСчетов", 		 НомераТаблиц.Количество());
		НомераТаблиц.Вставить("СторноЗакрытиеСчетовТаблица", НомераТаблиц.Количество());
		
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
		ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	Реквизиты.Регистратор КАК Регистратор,
		|	Реквизиты.ДатаСторно КАК Период,
		|	Реквизиты.Организация КАК Организация,
		|	Реквизиты.Сценарий КАК Сценарий,
		|	Реквизиты.ВидЗакрытия КАК ВидЗакрытия,
		|	Реквизиты.НастройкаЗакрытия КАК НастройкаЗакрытия,
		|	Реквизиты.РегистрБухгалтерии КАК РегистрБухгалтерии,
		|	Реквизиты.ОтразитьВЗакрытомПериоде КАК ОтразитьВЗакрытомПериоде,
		|	Реквизиты.ИмяРегистра КАК ИмяРегистра
		|ИЗ
		|	Реквизиты КАК Реквизиты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.ЦФО КАК ЦФО,
		|	ТаблицаДокумента.Счет КАК Счет,
		|	ТаблицаДокумента.Субконто1 КАК Субконто1,
		|	ТаблицаДокумента.Субконто2 КАК Субконто2,
		|	ТаблицаДокумента.Субконто3 КАК Субконто3,
		|	ТаблицаДокумента.Субконто4 КАК Субконто4,
		|	ТаблицаДокумента.Подразделение КАК Подразделение,
		|	ТаблицаДокумента.СчетЗакрытия КАК СчетЗакрытия,
		|	ТаблицаДокумента.ВидУчета КАК ВидУчета,
		|	ТаблицаДокумента.ДтКт КАК ДтКт,
		|	ТаблицаДокумента.СубконтоЗакрытия1 КАК СубконтоЗакрытия1,
		|	ТаблицаДокумента.СубконтоЗакрытия2 КАК СубконтоЗакрытия2,
		|	ТаблицаДокумента.СубконтоЗакрытия3 КАК СубконтоЗакрытия3,
		|	ТаблицаДокумента.СубконтоЗакрытия4 КАК СубконтоЗакрытия4,
		|	ТаблицаДокумента.ПодразделениеЗакрытия КАК ПодразделениеЗакрытия,
		|	-ТаблицаДокумента.Количество КАК Количество,
		|	ТаблицаДокумента.Валюта КАК Валюта,
		|	-ТаблицаДокумента.ВалютнаяСумма КАК ВалютнаяСумма,
		|	-ТаблицаДокумента.Сумма1 КАК Сумма1,
		|	-ТаблицаДокумента.Сумма2 КАК Сумма2,
		|	-ТаблицаДокумента.Сумма3 КАК Сумма3,
		|	-ТаблицаДокумента.Сумма4 КАК Сумма4,
		|	ТаблицаДокумента.Содержание КАК Содержание,
		|	ТаблицаДокумента.НомерЖурнала КАК НомерЖурнала,
		|	ТаблицаДокумента.СчетПредставление КАК СчетПредставление
		|ИЗ
		|	ТаблицаДокумента КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	КонецЕсли;
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();

КонецФункции

Функция ТекстЗапросаНастройкаЗакрытия(НомераТаблиц)
	
	НомераТаблиц.Вставить("НастройкаЗакрытия", НомераТаблиц.Количество());
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ИменаРесурсов.ИмяРесурса КАК ИмяРесурса,
	|	ИменаРесурсов.ИмяРеквизита КАК ИмяРеквизита
	|ИЗ
	|	Справочник.бит_НастройкиЗакрытия.ИменаРесурсов КАК ИменаРесурсов
	|ГДЕ
	|	ИменаРесурсов.Ссылка = &НастройкаЗакрытия";

	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции
 
Процедура ДобавитьПроводку(Проводка, Реквизиты,  Данные, СторонаПроводки, ИменаРесурсов)
	
	Проводка.Период = Реквизиты.Период;	
	ЗаполнитьЗначенияСвойств(Проводка, Реквизиты);
	ЗаполнитьЗначенияСвойств(Проводка, Данные);
	
	// Заполним сторону проводки для счета.
	ЗаполнитьСторонуПроводкиДляСчета("Счет", Проводка, Данные, СторонаПроводки);
	
	СторонаПроводки = ?(СторонаПроводки = "Дт", "Кт", "Дт");
	
	// Заполним сторону проводки для счета закрытия.
	ЗаполнитьСторонуПроводкиДляСчета("СчетЗакрытия", Проводка, Данные, СторонаПроводки);
	
	// Заполним суммы.
    МетаРегРесурсы = Метаданные.РегистрыБухгалтерии[Реквизиты.ИмяРегистра].Ресурсы;
    Для Каждого ТекИмя Из ИменаРесурсов Цикл
        
        ТекИмяРесурса = ТекИмя.ИмяРесурса;
        МетаРесурса   = МетаРегРесурсы.Найти(ТекИмяРесурса);
        
        Если МетаРесурса <> Неопределено Тогда
            Если МетаРесурса.Балансовый Тогда
                Проводка[ТекИмяРесурса] = Данные[ТекИмя.ИмяРеквизита];
            Иначе
                Если Реквизиты.ИмяРегистра = "Хозрасчетный" 
                    И (ТекИмяРесурса = "СуммаНУ" ИЛИ ТекИмяРесурса = "СуммаПР" ИЛИ ТекИмяРесурса = "СуммаВР") Тогда
                    СвойстваСчетаДт = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка.СчетДт);
                    СвойстваСчетаКт = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка.СчетКт);
                    Если СвойстваСчетаДт.НалоговыйУчет Тогда
                        Проводка[ТекИмяРесурса + "Дт"] = Данные[ТекИмя.ИмяРеквизита];
                    КонецЕсли;
                    Если СвойстваСчетаКт.НалоговыйУчет Тогда
                        Проводка[ТекИмяРесурса + "Кт"] = Данные[ТекИмя.ИмяРеквизита];
                    КонецЕсли;
                Иначе	
                    Проводка[ТекИмяРесурса + "Дт"] = Данные[ТекИмя.ИмяРеквизита];
                    Проводка[ТекИмяРесурса + "Кт"] = Данные[ТекИмя.ИмяРеквизита];
                КонецЕсли;                
            КонецЕсли;
        Иначе
            Проводка[ТекИмяРесурса] = Данные[ТекИмя.ИмяРеквизита];
        КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСторонуПроводкиДляСчета(ИмяРеквизитаСчет, Проводка, Данные, СторонаПроводки)
	
	ИмяСчета = "Счет" + СторонаПроводки;
    Проводка[ИмяСчета] = Данные[ИмяРеквизитаСчет];
    
    Счет		  = Проводка[ИмяСчета];
    СвойстваСчета = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
		
	НачИмяСубконто = ?(ИмяРеквизитаСчет = "Счет", "Субконто", "СубконтоЗакрытия");
	
	Для Ном = 1 По СвойстваСчета.КоличествоСубконто Цикл
		бит_БухгалтерскийУчет.УстановитьСубконто(Счет, Проводка["Субконто" + СторонаПроводки], Ном, Данные[НачИмяСубконто + Ном]);
	КонецЦикла;	
	
	Если СвойстваСчета.УчетПоПодразделениям Тогда
		ИмяПодразделения = ?(ИмяРеквизитаСчет = "Счет", "Подразделение", "ПодразделениеЗакрытия"); 
		Проводка["Подразделение" + СторонаПроводки] = Данные[ИмяПодразделения];
	КонецЕсли; 
	
	Если СвойстваСчета.Количественный Тогда
		Проводка["Количество" + СторонаПроводки] = Данные.Количество;
	КонецЕсли;
            
	Если СвойстваСчета.Валютный Тогда
		Проводка["Валюта"		 + СторонаПроводки] = Данные.Валюта;
		Проводка["ВалютнаяСумма" + СторонаПроводки] = Данные.ВалютнаяСумма;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнитьСодержаниеПроводки(ТаблицаЗакрытия, Сторно)

	Для каждого СтрокаТаблицы Из ТаблицаЗакрытия Цикл
		Если ПустаяСтрока(СтрокаТаблицы.Содержание) Тогда
			СтрокаТаблицы.Содержание = СтрШаблон(НСтр("ru='Закрытие счета %1';en='Closing an account %1'"), СтрокаТаблицы.СчетПредставление);
		КонецЕсли; 
		
		Если Сторно Тогда
			СтрокаТаблицы.Содержание = НСтр("ru = 'Сторно:'") +  СтрокаТаблицы.Содержание;	
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры
 
#КонецОбласти 

#КонецЕсли
